[{"title":"职业转型思考","date":"2020-05-10T04:39:38.000Z","path":"2020/05/10/202005101239/","text":"今天母亲节，祝母亲们幸福安康！希望我的她，也尽快成为一位母亲。 今年是创业的第6个年头，比往年不同的是，今年更苦一些。帐上的资金已剩不多，团队心态少了那份激情。这周其中一个合伙人离职，一起风雨了6个年头，一直未同甘，只有共苦。希望兄弟你找到自己喜欢的平台，祝你前程似锦！找个好人家，赶紧娶了，早些成家。 \b人到中年身不由己，再联想到公司目前近况，不免有些忧愁。一是创业这么久，心中那份不甘，仍未实现。二是对一起奋斗的兄弟感到愧疚。三是职业的迷茫。四是希望自己有个后，把我和她的优良基因传承下去。归根到底，这些都是“穷病”。穷人分两种，乐观的穷人和悲观的穷人。我是个乐观的穷人。\b\b\b人生在世，活得心安理得。家人和身边的朋友平安就是幸福。 想谈谈职业的迷茫，我一直在思考，自己在公司的定位以及以后在对职业的规划。站在局外人的角度来讲，会觉得一个创业六年的兵，甚至对自己职业规划会迷茫，这个业是白创了。我很赞同这种观点，同时也更希望抱有这样观点的人，加入初创公司，从0开始体验一遭。 对于这次创业有很多的感想，想通过结合感想，获取最终的规划。在这次创业过程中多次转型，转型的原因在于个人的贡献已经达到瓶颈。虽然看起来只是这么简短的一段话，但这个过程我经历过后端开发、全栈开发工程师、测试工程师、销前工程师、产品经理、项目经理，虽然公司TITLE是VP，但个人职业覆盖比较广，也同时贯穿了整个项目的生命周期。从0到1，从1到80，从80到0的过程。之所以迷茫就是因为涉及的工作多而杂，而不够精。如果说这么多的职业转型为我带来了什么，非常肯定的是个人能力上的提升。 未来准备做什么？这是很关键的问题，哪个行业，哪个职业？如果从这么多的行业和职业去选择一条路去走。该如何选择？行业的话应该还是安全行业，毕竟在这个行业已经积累了一些。职业，如果有选择的话，我觉得是项目经理或者产品经理。从能力来讲我更倾向于站在对方的角度看问题并能够让需求转变为产品，将产品语言转变为技术实现，最终将产品落地的能力。反之亦然。未来的一段时间我将会强化这方面的知识。","tags":[{"name":"转型","slug":"转型","permalink":"https://lucky3w.github.io/tags/转型/"}]},{"title":"Mac下虚拟机Virtual中CentOS没有IP不能访问网络","date":"2019-09-06T07:57:00.000Z","path":"2019/09/06/201909061657/","text":"2019年第一篇。随着年龄的增大发现自己精神上变得越来越”臃肿”!1vi /etc/sysconfig/network-scripts/ifcfg-enp0s3 修改 ONBOOT=yes 后, 保存退出执行命令：service network restart ONBOOT是指明在系统启动时是否激活网卡，只有在激活状态的网卡才能去连接网络，进行网络通讯","tags":[{"name":"VirtualBox","slug":"VirtualBox","permalink":"https://lucky3w.github.io/tags/VirtualBox/"}]},{"title":"成功者的思维方式","date":"2018-01-13T04:12:12.000Z","path":"2018/01/13/201801131212/","text":"2018年第一篇。2018我给自己设定了几个目标，其中之一就是读书，读书也分几种方式，常用的是纸质版、电子版、现在还有音频版本。目前常用的app有，得到app、喜玛拉雅、微信读书，当然还有很多。找一份适合自己的app来读书是一件很幸福的一件事。 由于我的时间比较碎片化，自认为得到app的这种读方式很适合我，一本书自己去阅读的话，至少需要一周时间，而且里面的知识点不一定全部都能掌握，使用得到后，可以说是站在”巨人”的肩上梳理主要思想，然后自己再逐个去深入理解并结合实际的工作，并运用到生活里，真是的一个不错的选择。 在得到app上重复听了至少三遍的《成功者的大脑》这本书的解读，书的内容里有很多值得去学习的地方，以后将每次学到的知识一一记录。以便日后的查阅。 《成功者的大脑》豆瓣评分7.0 简介《成功者的大脑》一书作者认为，与传统的观念相反，成功与IQ、环境、经济状况、人脉网络等因素没什么关系，甚至跟运气也几乎无关。成功的关键在于大脑。你的大脑怎么运作决定了你的思维、感受和行动。 《成功者的大脑》作者结合最前沿的心理学和脑科学研究，走访几十位不同领域的成功者，发现成功者实现成功的方式可能非常不同，但他们的大脑具有相同的5种脑力工具。锻炼这些脑力工具，每个人都能开发自己的成功者大脑。利用8大成功要素可以塑造你的大脑，让它充分施展自己的潜能。 作者简介[美] 杰夫•布朗（Jeff Brown） ★哈佛大学心理学家，任职于哈佛医学院心理系和哈佛医学院附属麦克莱恩医院，帮助需要控制心理疾病症状的病人，也教人们运用有效的技巧调节大脑，过上积极乐观的生活。 ★获得美国职业心理学委员会（American Board of Professional Psychology）颁发的认知行为心理学和临床心理学双项认证；获得应用运动心理学学会（the Association for Applied Sport Psychology）颁发的职业运动心理咨询师认证。 ★在过去的十年里一直担任波士顿马拉松赛心理医生，也是《跑者世界》杂志（Runner’s World）科学咨询委员会成员。 ★著心理学见解被多家媒体报道，包括《纽约时报》（The New York Times）、《华尔街日报》（The Wall Street Journal）、《波士顿环球报》（The Boston Globe）、《创业家》（Entrepreneur Magazine）等。 ★《成功者的大脑》是布朗最畅销的书之一，已在多个国家出版。除此之外，布朗还著有《竞争时代：如何保持常胜不败》（The Competitive Edge: How to Win Every Time You Compete）、《对压力说再见》（Say Goodbye to Stress）和《积极思考健康》（Think Positive for Great Health）。 ★2010年，布朗获得中央密苏里大学的荣誉博士学位。 马克•芬斯克（Mark Fenske） ★曾在哈佛大学医学院任职，现在加拿大圭尔夫大学任心理学副教授。 ★结合脑神经影像和认知行为研究，探知大脑的注意力和情绪系统如何影响人的行为。 莉斯•内伯伦特（Liz Neporent） ★著有多种健康题材的畅销书，曾与许多知名出版方合作。 主体思想：","tags":[{"name":"读书","slug":"读书","permalink":"https://lucky3w.github.io/tags/读书/"}]},{"title":"Shadowscoks翻墙","date":"2017-11-26T07:11:52.000Z","path":"2017/11/26/201711261511/","text":"一直认为翻墙没什么难度，今天自己重新搭建了一次，竟然花费了将近两个小时，今天详细记录，以备不时之需。 场景介绍：使用浏览器(Chrom)查看资料。 一、基础环境翻墙服务器: AWS EC2 Ubuntu系统(其他家的云服务也可以，推荐使用日本地区，访问速度比较快)翻墙客户端: Mac 二、搭建服务器翻墙环境123456789101112131415161718192021sudo -iapt-get updateapt-get install python-pip＃ 在该文件最后一行添加 export LC_ALL=C 后，保存退出vim ~/.bashrcsource ~/.bashrcpip install shadowsocks# 创建配置文件, 输入以下配置,保存退出vim shadowsocks.json&#123; \"server\": \"0.0.0.0\", \"server_port\": 443, \"local_address\": \"127.0.0.1\", \"local_port\": 5555, \"password\":\"123!@Q$\", \"timeout\":300, \"fast_open\": false, \"workers\": 1, \"method\":\"aes-256-cfb\"&#125;nohup ssserver -c shadowsocks.json start &amp; 三、配置翻墙客户端环境123456789101112131415pip install shadowsocks# 创建配置文件, 输入以下配置,保存退出vim shadowsocks.json&#123; \"server\": \"翻墙服务器IP\", \"server_port\": 翻墙服务器端口, \"local_address\": \"127.0.0.1\", \"local_port\": 5555, \"password\":\"123!@Q$\", \"timeout\":300, \"fast_open\": false, \"workers\": 1, \"method\":\"aes-256-cfb\"&#125;sslocal -c aproxy.json -d start 四、配置Chrom代理推荐使用SwitchyOmega插件。代理协议使用Socket5，代理服务器使用127.0.0.1，代理端口使用5555。（端口可以在配置文件中修改)","tags":[{"name":"工具","slug":"工具","permalink":"https://lucky3w.github.io/tags/工具/"}]},{"title":"自我剖析","date":"2017-06-16T13:12:58.000Z","path":"2017/06/16/201705291924/","text":"从始至终，我都没有好好的分析过自己，也从没有系统总结自己的优缺点。一个人性格，会导致做事的成与败。 以往只是简单的理解得道多助，失道寡助。能做到是多么难得。可以让多数人喜欢你，相信这个人的菱角被自己磨的跟平滑。 并不是你都会每个人的无私，关怀就代表你的多助，而是在他们最需要的时刻，你能站出来，那才能让他真正的从心底对你感恩。千万不要让自己的爱心泛滥。 我从小是个赌性十分强的人，使我得性格变化最大的是初中，初中让我学到的是忍耐，忍耐对自己的不公。高中我学到的是勤奋和节俭，那个时候哥哥结婚，父母生病，家里也没有任何的积蓄，一心想踏入人生得天堂。大学。大学里迷失了自我，让我变得做任何事的时候都不自信。 总结一句，我是一名做事没有信心，勤奋忍耐性很强，内心安分，而又患得患失，并没有任何兴趣爱好的一个人。 我不是一个合格的创业者，至今我从没理性的分析一件事的错与对。想的太少，错的太多。很多决定都是随大流。缺少独立的人格魅力。","tags":[{"name":"创业者","slug":"创业者","permalink":"https://lucky3w.github.io/tags/创业者/"}]},{"title":"2017前半年总结","date":"2017-06-16T12:49:24.000Z","path":"2017/06/16/201706162048/","text":"恐惧过，试图逃避过，人生必经历的两种状态。半年来，睡的最好的一次是昨天晚上，这段时间，是我创业三年来，最痛苦和焦虑的时段. 应该是自己经历的太少，所以遇到的困难就被认为是最难过的时候。创业的这段时间更让我懂得了应该好好珍惜，并且享受这段时光。 让自己能变的更坚强，并能够获得终生受益的才能。这段时间和三方沟通，让我学会了最基本的沟通，理解如何沟通，以及沟通的目的。 也让我看到自己很多不足的地方，比如易怒，易燥，很容易把负面情绪带给其他人。总结一下自己的缺点： 1、对事件看待的角度还是不全面，缺少对大局的掌控能力。 2、自己的应变能力不足，有时遇到时候，很容易情绪变。 3、产品定位和市场经验太少，不知道用户真正的需求，和第一点有点重复。 4、表达方式不正确，多去赞美他人，即使是批评也要侧面去表达。 5、坦然面对困难，多去探索未知的事物。 6、多读书，多去培养自己的兴趣点。","tags":[{"name":"创业","slug":"创业","permalink":"https://lucky3w.github.io/tags/创业/"}]},{"title":"生离死别","date":"2017-05-24T02:08:40.000Z","path":"2017/05/24/201705241010/","text":"怀念我的姥姥姥爷 在我的印象里，姥爷从来没给过我零花钱。姥姥走的早。母亲平常和我说，姥姥对每个人都很好，经常把家里的东西分给别人，那个时候姥爷是村里的会计，在那个年代的山村里，算是知识水平比较高的一份子。因为姥姥经常把自家的东西送别人，姥爷经常骂姥姥。姥姥的早逝，也算是一种解脱…… 姥姥给我留下的两个印象，一个是每次去姥姥家，姥姥就会从里屋的柜子里拿好吃的给我。另外一个是姥姥当时得了眼癌，一边脸肿的高高的坐在炕头，靠着被子。感觉她从未走远。 今早给父亲电话，姥爷昨天已经下葬。姥爷一直有肺结核，我原以为是因为肺结核导致姥爷的去世。其实姥爷患了口腔癌。姥爷走的太突然，我记得姥爷最大的愿望是来首都看看天安门，仰望毛主席。至他离世，也没有达成这个愿望。 姥爷的母亲，我的太姥姥，是名共产党，因为日本士兵扫荡村子的时候，为了拿包裹，被日本士兵发现，被活活打死。姥爷那个时候还很小。这些片段，在我2015年夏天，回家的时候，姥爷义气填膺的跟我描述，并从一个很旧很旧的布兜里拿出英雄的证书。从姥爷的眼神里我看到的是骄傲，同时也看到因为战争，童年丧母的痛楚。 姥爷给我留下也是两个，一个经常在村子里的桥头，姥爷经常在那坐着。还有一个就是2015年夏天，姥爷问我北京天安门什么人最多，我说了句中国人，姥爷笑着反驳我，我还不知道中国人多？我是第一次见到姥爷笑。致敬我可爱的姥爷。请您原谅我没有见您最后一面。 写的过程中哭了三段…… 姥爷见到姥姥后，别再为生活争吵，幸福得度过……","tags":[{"name":"生活","slug":"生活","permalink":"https://lucky3w.github.io/tags/生活/"}]},{"title":"充实和快乐、生活和现实","date":"2017-03-19T14:15:43.000Z","path":"2017/03/19/201703192215/","text":"很久没有更新了，最近的日子过的太充实，有时竟然忘记了当下的自己，自己是谁，自己在做什么？结果又是怎样的？ 充实和快乐、生活和现实，这两者本来没有太多的关系。今天竟然突出奇想。硬生生的把这两者联系到了一起。 正常的来说充实和快乐，是一件幸福的事，因为有事可做，每天不至少会浪费时间在没有意义上的事。充实的内容，也全都是与工作相关的，快乐的事，也是因为工作能处理完成了一件又一件，而被别人认可。男人可能就是需要这种被他人需要的感觉，才会觉的自己存在的意义吧。 生活和现实，却让我无比的烦恼，作为一个北漂，身边的人无时无刻的主题，都是房子。以前讨论的是5环的房子，现在讨论7环的房子，觉的也是件奢侈的事。身边的朋友，梦想，是在7环内有个房儿。我也不例外。每每想到这，我都怀疑现在做的一切是否真的有意义。人生本不该如此。美好的时光，也就在这几年。我一直有想远行的梦想，走遍从未走过的地方，去经历没有做过的事。 时光冉冉，不能被生活和现实而被打倒。人活着，就得活的像个人样儿！","tags":[{"name":"生活","slug":"生活","permalink":"https://lucky3w.github.io/tags/生活/"}]},{"title":"如何行使你的管理权","date":"2017-02-14T14:04:33.000Z","path":"2017/02/14/201702142204/","text":"我不知道什么是管理者。我只知道团队多一个兄弟，身上的担子又重了一些。因为每个兄弟是带着更高的追求，也是出于信任，才会和我在一个团队里。 在一起工作，是缘份，虽然我没有什么信仰，但是总觉得冥冥之中注定的事，逃是逃不掉。哪儿怕走错一小步。 团队的执行力差，效率不高，不是个人的问题，那只说你的领导力不够。没有知人善用。如何行使管理权？怎样行使管理权？ 首先我把人分为以下两类： 有心，而力足。 有心，而力不足。 为什么无心的人，我没有把他列在这个列表里。是因为我首先觉得，人的价值观首先是好的。我不会欢迎价值观不好的人，具体举个例子，就是混日子，能混一天是一天那种。即使来到我的团队，最终也会被淘掉。人不是傻子，画大饼去给人洗脑，最终却没有达成兑现。这种行为很可耻，我劝你也不要加入这样的团队。作为一个领导，在人加入你的团队，一定要给人讲清楚。 步入正题：自己总结一个理论，叫做1+1理论。具体是指：比如你问A同学，1+1等于几呢？A同学会立即答到等于2。然后A同学会反问你，为什么要问这个问题？其他也有很多情况等于2的。比如2-0，4-2……比如你问B同学，1+1等于几呢？B同学也会立即答到等于2。然后…..A同学属于第一类，具体敏捷的思维能力，能对当前事物做出判断，并且可以对其他情况进行分析。B同学属于第二类，只关注眼前的是与非，不去考虑其他因素。缺乏对事情的思考。这就是所谓的力不足吧。 第1类人：信任他，交给一件事去做，设置完成时间点。在交付的日期进行沟通。 第2类人：以培养为主，即使再笨的人，也有用武之地。将具体要分配的工作，进行拆解，定制相关文档和内容。多去沟通。还是拿上面的例子，你需要进行拆解，比如你需要指引他，还有哪些需要考虑的。为什么这么考虑？把这个隐藏的因素讲清楚。","tags":[{"name":"创业","slug":"创业","permalink":"https://lucky3w.github.io/tags/创业/"}]},{"title":"学习之前的第一步","date":"2017-02-09T14:40:11.000Z","path":"2017/02/09/201702092240/","text":"我喜欢路飞, 因为他总能保持积极的心态，去探索未知的海域！从不认输，即使也有失败的时候，哪儿怕从头再来！做技术也有几年了，没有成为大牛，主要还是因为自己对技术还没有到达痴迷的境界，如果让我再做一次选择的话，我一定做一个销售。 主要和我的性格也有关系。我不太喜欢交际，这是我的弱点，正在因为是自己性格的缺陷，所以才要选择自己认为难走的路。 学习之前的第一步，我之所以放到python的tags中，是和自己的工作经历有关系，因为接触python后，第一次让我找到编程的乐趣。也是python给我继续做技术的勇气。 让我发生改变的的最大的是16年8月份。平常自认为没有完成不了的事，直到自己遇到从未接触过的工作，才自己有多脆弱。再过俩个月，创业已经有3年，回头展望，才发现自己是多么的幼稚。 一路上遇到很多困难，都逐一解决，每次克服一个困难，都会有所成长，有所收获。 我认为，阻挡你前进的人，只是你自己。 每个人都喜欢呆在舒适区，恐惧也是与生俱来的，特别是在面对未知的事物时候。 心里不要给自己暗示，这么难的问题，我怎么能解决的了？ 你要相信自己可以，发生的事情，也必须要解决。这一刻，你要对自己说你可以。 不仅仅学习python，即使是其他的事情，别人能做到的，你也一样能做到。 －－只有相信改变世界的，才有可能改变世界！致自己。","tags":[{"name":"python","slug":"python","permalink":"https://lucky3w.github.io/tags/python/"}]},{"title":"理想-赵雷","date":"2017-02-05T14:30:28.000Z","path":"2017/02/05/201702052230/","text":"回归北京，对家乡依旧恋恋不舍，想想年迈的父母，心中总有不甘。依旧放不下那份理想，2017向理想冲刺！理想作曲 : 赵雷作词 : 赵雷一个人住在这城市为了填饱肚子就已精疲力尽还谈什么理想那是我们的美梦 梦醒后 还是依然奔波在风雨的街头有时候想哭就把泪 咽进一腔热血的胸口 公车上我睡过了车站一路上我望着霓虹的北京我的理想把我丢在这个拥挤的人潮车窗外已经是一片白雪茫茫 又一个四季在轮回而我一无所获的坐在街头只有理想在支撑着那些麻木的血肉 理想今年你几岁你总是诱惑着年轻的朋友你总是谢了又开 给我惊喜又让我沉入失望的生活里 公车上我睡过了车站一路上我望着霓虹的北京我的理想把我丢在这个拥挤的人潮车窗外已经是一片白雪茫茫 又一个四季在轮回而我一无所获的坐在街头只有理想在支撑着那些麻木的血肉 理想今年你几岁你总是诱惑着年轻的朋友你总是谢了又开 给我惊喜又让我沉入失望的生活里 又一个年代在变换我已不是无悔的那个青年青春被时光抛弃已是当父亲的年纪 理想永远都年轻你让我倔强地反抗着命运你让我变得苍白却依然天真的相信花儿会再次的盛开 阳光之中 到处可见奔忙的人们被拥挤着 被一晃而飞的光阴忽略过","tags":[{"name":"音乐","slug":"音乐","permalink":"https://lucky3w.github.io/tags/音乐/"}]},{"title":"公司的力量-猎富时代","date":"2017-01-26T23:04:17.000Z","path":"2017/01/27/201701270704/","text":"&lt;&lt;常识&gt;&gt;一书对民众的影响力，仅次于圣经。 我是不会选择做一个普通人，如果我能够做到的话，我有权成为一位不寻常的人，我寻找机会，但我不寻求安稳，我不希望在国家的照顾下，成为一名有保障的国民，那将被人瞧不起。而使我感到痛苦不堪，我要做有意义的冒险，我要梦想，我要创造，我要失败，我也要成功，我的天性是挺胸直立，骄傲而无所畏惧，我勇敢地面对这个世界，自豪地说，在上帝的故事下，我已经做到了！ 看完这部记录片，很振憾！直接可以说公司在推进历史的进步，一点都不夸张。伟大的发明者，创造产品，由公司转化为商，最终普及大众。还有一句话令我印象很深刻：公司可以成就平凡的人做不平凡的事。 我是一个平凡的人。","tags":[{"name":"段子","slug":"段子","permalink":"https://lucky3w.github.io/tags/段子/"}]},{"title":"ElasticSearch基本介绍","date":"2017-01-14T13:46:54.000Z","path":"2017/01/14/201701142145/","text":"ElasticSearch起源多年前，一个叫做Shay Banon的刚结婚不久的失业开发者，由于妻子要去伦敦学习厨师，他便跟着也去了。在他找工作的过程中，为了给妻子构建一个食谱的搜索引擎，他开始构建一个早期版本的Lucene。 直接基于Lucene工作会比较困难，所以Shay开始抽象Lucene代码以便Java程序员可以在应用中添加搜索功能。他发布了他的第一个开源项目，叫做“Compass”。后来Shay找到一份工作，这份工作处在高性能和内存数据网格的分布式环境中，因此高性能的、实时的、分布式的搜索引擎也是理所当然需要的。然后他决定重写Compass库使其成为一个独立的服务叫做Elasticsearch。第一个公开版本出现在2010年2月，在那之后Elasticsearch已经成为Github上最受欢迎的项目之一，代码贡献者超过300人。一家主营Elasticsearch的公司就此成立，他们一边提供商业支持一边开发新功能，不过Elasticsearch将永远开源且对所有人可用。Shay的妻子依旧等待着她的食谱搜索…… Elasticsearch是一个基于Apache Lucene(TM)的开源搜索引擎。无论在开源还是专有领域，Lucene可以被认为是迄今为止最先进、性能最好的、功能最全的搜索引擎库。 但是，Lucene只是一个库。想要使用它，你必须使用Java来作为开发语言并将其直接集成到你的应用中，更糟糕的是，Lucene非常复杂，你需要深入了解检索的相关知识来理解它是如何工作的。 Elasticsearch也使用Java开发并使用Lucene作为其核心来实现所有索引和搜索的功能，但是它的目的是通过简单的RESTful API来隐藏Lucene的复杂性，从而让全文搜索变得简单。 不过，Elasticsearch不仅仅是Lucene和全文搜索，我们还能这样去描述它： 分布式的实时文件存储，每个字段都被索引并可被搜索 分布式的实时分析搜索引擎 可以扩展到上百台服务器，处理PB级结构化或非结构化数据 以上内容摘自Elasticsearch权威指南 个人认为，使用之前要明白什么是库表，什么是文档。如果说与数据库相比较的话，库表是mysql里的数据库，文档是mysql里的表，es中是用doc_type来区分属于哪张表，所以在配置mapping的时候，需要对同一库表不同doc_type配置每个字段属性。 然后再去理解怎么在es中添加记录，以及桶的设计理念，在对es做查询时，我推荐使用SQL PLUGIN，要比原生的es查询语句简单的多。es会对字符串类型的属性分词，如果有对中文做聚类时，一定要对分析的中文字字段，设计为不分词。为什么要分词，这是es在做倒排索引时需要，具体可以查相关的文档。 谈到ElasticSearch，肯定也会联想到Logstash和kibana。后续会更新这三者如何搭配置使用。","tags":[{"name":"elasticsearch","slug":"elasticsearch","permalink":"https://lucky3w.github.io/tags/elasticsearch/"}]},{"title":"Redis基本介绍和集群模式","date":"2017-01-08T14:37:08.000Z","path":"2017/01/08/201701082237/","text":"Redis是什么？ 内存NoSQL数据库，可做缓存，消息中间件等 丰富的数据结构，list, hash, set等 支持持久化aof(日志追加),rad(快照) 单线程, 可以避免进程之间共享资源而影响读写速度 &#160; &#160; &#160; &#160;是一种k-v结构的数据库，使用方便，简单，一般，读写速度快，因为是单线程，一般只需要双核CPU已经足够，另外留一核处理系统进程。内存和硬盘随数据调整。常用的k-v数据还有memcache，mongodb，memcache不能将数据持久化，一般服务器重启，数据也就丢失了。mongodb数据结构更接近于关系型数据库。 Redis集群方式: Standalone模式，单主，一主多从，通过Sentinel实现高可用 Cluster模式，从主0从，多主多从，至少三主（三个分片） 客户端hash分片 &#160; &#160; &#160; &#160;以下抄自知乎网友:&#160; &#160; &#160; &#160;官方推荐使用Cluster模式，在RedisCluster中，Sharding采用slot(槽）的概念，一共分为16384个槽。对于每个进入Redis的键值对，根据key进行散列，分配到16384个slot中的某一个中，使用的hash算法也比较简单，就是CRC16后与16384取模。这种集群方式，必须保证16384个solt相参应的node都正常工作，如果某个node发生故障，那它负责的slots也就失效，整个集群将不能工作。 &#160; &#160; &#160; &#160;为了增强集群的可用性，官方推荐的方案是将node配置成主从结构，即一主，多从，如果主节点失效，Cluster会根据选举算法从slave节点中选择一个升为主节点。，整个集群继续对外提供服务。 &#160; &#160; &#160; &#160;Cluster的新节点识别能力和故障判断及故障转移能力是通过集群中的每个node都在和其它nodes进行通信，这被称为集群总线(cluste bus)。它们使用特殊的端口号，即对外服务端口加10000。例如如果某个node的端口是6379，那么它与其他nodes通信的端口是16379。nodes之间的通信采用特殊的二进制协议。","tags":[{"name":"redis","slug":"redis","permalink":"https://lucky3w.github.io/tags/redis/"}]},{"title":"hexo博客在配置被百度和Google收录时的坑","date":"2017-01-08T07:46:06.000Z","path":"2017/01/08/201701081540/","text":"引言：使用hexo搭建博客的同学，为了避免其他同学掉到坑里，今天把我遇到问题，总结一下。 以下是两个搜索引擎提交入口： 百度 Google 提前声明一下，github把百度的抓虫给封掉了，以是下截图： 坑一：使用搜索引擎的文件认证方式，一定要把认证的文件，放到主题下的source目录下。如果放在项目的source下，在生成静态文件时，会修改认证文件内容。添加的目录结构如下： 坑二：在使用插件生成sitemap.xml的文件时，生成的sitemap.xml中的标签地址不正确。网上有些料资，说是单独对生成的sitemap.xml进行修改。我不建议这样做。插件在发布的时候，会使用项目目录下的_config.xml中的url配置。修改项目下_config.xml中的url配置为你的url地址。 url: https://lucky3w.github.io","tags":[{"name":"hexo","slug":"hexo","permalink":"https://lucky3w.github.io/tags/hexo/"}]},{"title":"自省","date":"2017-01-05T14:18:10.000Z","path":"2017/01/05/201701052220/","text":"&#160; &#160; &#160; &#160;2017依旧很忙，唯一不同的是，2017要比2016还要忙。 &#160; &#160; &#160; &#160;从元旦前到现在一直在想，怎么解决这个问题。这段时间，也终于有了结论，就像故事里的主人公一一样。只顾茶匙里的两滴油 &#160; &#160; &#160; &#160;自己为什么一直在忙于工作，主要还是自己的认知有问题。自己心里总是认为不好的东西，就不要去学习，不要去吸收。这就是认知上的错误。 &#160; &#160; &#160; &#160;做事，太专注，只专注于事情的本身。这是最大的优点，也是最大缺点。 &#160; &#160; &#160; &#160;优点，是可以快速的执行，有更多的时间能够不断的摸索，并且尝试。不断的试错机会。并且可以讯速的实现。所以只能用supper worker，这个词来形容。 &#160; &#160; &#160; &#160;缺点，不懂得全局去考虑问题，与该事情相关的因素考虑的太少。这就缺少了对事情的把控能力。遇到除事件之外的事情，就无法快速解决。形容出现阻断问题。 &#160; &#160; &#160; &#160;很多时候，我都在想，为别人，做更多的事，所以想尽快的实现和解决问题。但是终究几年下来，收获甚少。最终就像一个工具，可替性太强，自己在沿途中，错过了很多的风景。失去的太多。考虑别人太多。反而没有考虑过自己。2017也该为自己想想。立下三个愿望: 除专注事情之外，多去思考。做个合格的管理者 扩充自己更多的视野（专业知识, 团队管理） 学习产品设计，17年准备打造一款产品 组建一支狼性的团队","tags":[{"name":"创业者","slug":"创业者","permalink":"https://lucky3w.github.io/tags/创业者/"}]},{"title":"摘自-牧羊少年奇幻之旅","date":"2017-01-05T13:49:33.000Z","path":"2017/01/05/201701052150/","text":"&#160; &#160; &#160; &#160;一位商人派他的儿子去向人类的智慧大师讨教幸福的秘密。少年在沙漠中跋涉四十天，最后来到一座美丽的城堡。城堡坐落在高山之巅，少年寻找的智慧大师就住在那里。&#160; &#160; &#160; &#160;少年没有遇到圣人，却走进了一个大厅，看见一派热闹的场面：商人进进出出，四周角落里的人在聊天，一支小乐队演奏着曼妙的轻音乐，桌子摆满了当地的美味珍馐。智慧大师在同所有的人交谈，足足等了两个小时才轮到少年。 &#160; &#160; &#160; &#160;智慧大师认真地听完少年陈述此番来方的目的，却说他此刻没时间给他讲解幸福的秘密。他建议少年先在他的城堡里转一转，两个小时后再回来见他。同时，我想请你办件事，智慧大师说着，递给少年一把茶匙，并在茶匙里滴油。你走路的时候拿着这把茶匙，不要让没洒出来。 &#160; &#160; &#160; &#160;少年开始沿着城堡的大小台阶上上下下，两眼始终盯着那茶匙不放。两个小时之后，他回到智慧大师面前。 &#160; &#160; &#160; &#160;大师问道：你看见我餐厅里的波斯壁毯了吗？你看见园艺大师耗时十年培育的花园了吧？你留意我图书馆里的那些漂亮的羊皮纸文献了吗？ &#160; &#160; &#160; &#160;少年很不好意思，坦白的说，他什么也没看到。当时他唯一关注的是不要让那两滴油酒出来，因为那是智者托付他办的事。 &#160; &#160; &#160; &#160;那你就再去看一看我城堡中的奇珍异宝吧。智慧大师说，如果你不了解一个人的家，就不能信任他。 &#160; &#160; &#160; &#160;少年放松下来，拿起茶匙，重新开始在城堡里漫步。这一次他注意到了挂在天花板上和墙壁上的那些艺术品，看到了花园，看到了周围的山岭，看到了娇嫩的鲜花，看到每件艺术品都摆放得恰到好处。再回到智慧大师面前时，他详细地叙述了刚才看到的一切。 &#160; &#160; &#160; &#160;可我托付你拿着的那两滴油在哪儿呢？智慧大师问。 &#160; &#160; &#160; &#160;少年一看那茶匙，发现没已经洒光了。 &#160; &#160; &#160; &#160;这正是我要给你的唯一忠告。智慧大师说，幸福的秘密就在于，既要看到世上的奇珍异宝，又要永远不忘记勺里的那两滴油。(感谢无脑大姐推荐此文)","tags":[{"name":"段子","slug":"段子","permalink":"https://lucky3w.github.io/tags/段子/"}]},{"title":"创业者","date":"2016-12-30T14:29:38.000Z","path":"2016/12/30/201612301029/","text":"&#160; &#160; &#160; &#160;我最近在考虑一件事，这件事从来没有这么认识的考虑过。我为什么这么忙？这么忙又是为了什么？可能答案在我看来只有一个，那就是你是一名正在创业的－创业者。正如图片上所写的，创业者把大量的时候花费在自己不会做的事。每做一件事的时候，是我可以！不去畏缩，这是多么勇敢而又可畏的人生。与其去想，不如去做，与其去做，不如把这件事最到最好！选择最艰难的路去走，选择最不会做的事去做，你才会有自己的收获！一定要把自己失败的目标，定义比成功要高，你才有可能成功！虽然每个遇到困难，心里也总有不安。把我的经验写下来，用来记念已经过去的2016年，2017年即将来。提前祝大家元旦快乐！同时感谢你送的头像（是我要的），祝你在新的一年开心快乐！&#160; &#160; &#160; &#160;首先，你要端正自己的心态，不要想着我不能做。一定要想着我能做，做培训的时候，我说的第一句话就是，相信自己可以。只有抱着这种心态，你的学习的才会更快，才不至于自己一旦遇到挫折，把这个消极的情绪放大。这种负能量很可怕，即影响了自己，也会影响到其他人。生活本来如此，既然无力改变，就去好好享受，没什么大不了。 &#160; &#160; &#160; &#160;其次，做到心无杂念，身心合一。创业在于执行力，执行力高，你才会更高效的处理自己事情。留下更多的时间，去思考怎样把这件事做的更好。而不是去考虑杂七杂八的事，被这些事扰乱了你的心志，相信这件事，你也做不好。 &#160; &#160; &#160; &#160;如果用一个平衡被打破，用另外一件事，使之保持平衡，这是管理者的心志，在创业的路上会遇上形形色色的人和形形色色的事。如果让自己做的事，处理一个平衡的状态，而不至于处于劣势，这就要求这个人必须有大局观。我个人缺乏大局观。这个需要在日后的生活里继续学习。 &#160; &#160; &#160; &#160;时刻要保持自己的幸福感，你这所以忙，是因为你重要！ &#160; &#160; &#160; &#160;无论做什么，要记住一句话：1$ print 'i can'","tags":[{"name":"创业者","slug":"创业者","permalink":"https://lucky3w.github.io/tags/创业者/"}]}]